Herschel–Bulkley/HB_25C/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (bioink air);

bioink
{

transportModel  HerschelBulkley;

	
HerschelBulkleyCoeffs
{
    k               [ 0 2 -1 0 0 0 0 ] 29.86e-3;
    n               [ 0 0  0 0 0 0 0 ] 0.46;
    tau0            [ 0 2 -2 0 0 0 0 ] 33.82e-3;
    nu0             [ 0 2 -1 0 0 0 0 ] 50e-3;
}

//2.5%w/v Alginate @ 25C

	rho             1025;
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}

sigma            0.07;
// ************************************************************************* //
